In [1]:
import pandas as pd

In [5]:
date_list = [{'date': '2000-06-27'},
         {'date': '2002-09-24'},
         {'date': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['date'])

In [6]:
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [7]:
def extract_year(date):
    return date.split('-')[0]

In [9]:
df['year'] = df['date'].map(extract_year) # 앞선 apply함수와 같은 효과

In [11]:
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [14]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)

In [15]:
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [16]:
# 머신러닝에서 object자료형을 숫자형으로 바꿔줄때 자주 사용한다. 일명 매핑
df.job = df.job.map({'student':1,'developer':2,'teacher':3})

In [17]:
df

   age  job
0   20    1
1   30    2
2   30    3

In [18]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)

In [19]:
df # 하나의 컬럼이 아닌 모든 컬럼을 바꾸고 싶을때 applymap을 사용

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [20]:
import numpy as np

In [21]:
df = df.applymap(np.around)

In [22]:
df # 모든 컬럼이 바뀌는 것을 볼 수 있다.

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0